üìù Apunte Introductorio: SQL en Python (para Notebook)

üéØ Objetivo del apunte

Aprender a:

Crear y conectar una base de datos SQLite desde Python

Crear tablas

Insertar datos

Realizar consultas SQL (SELECT, WHERE, ORDER BY, JOIN)

Leer resultados con cursor o con pandas

1Ô∏è‚É£ ¬øQu√© es SQL?

SQL (Structured Query Language) es un lenguaje dise√±ado para consultar y manipular bases de datos relacionales.

Permite:

- Crear tablas ‚Üí CREATE TABLE

- Insertar datos ‚Üí INSERT

- Consultar informaci√≥n ‚Üí SELECT

- Actualizar informaci√≥n ‚Üí UPDATE

- Eliminar informaci√≥n ‚Üí DELETE

2Ô∏è‚É£ Usar SQL dentro de Python

Python incluye por defecto sqlite3, una base de datos liviana que funciona con archivos .db.

üîå Conexi√≥n a SQLite

In [1]:
import sqlite3

# Crear o conectar a una base de datos
conn = sqlite3.connect("mi_base.db")

# Crear un cursor para ejecutar SQL
cursor = conn.cursor()

3Ô∏è‚É£ Crear una tabla con SQL

In [2]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS estudiantes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nombre TEXT NOT NULL,
    edad INTEGER,
    carrera TEXT
)
""")

conn.commit()

4Ô∏è‚É£ Insertar datos

In [3]:
cursor.execute("""
INSERT INTO estudiantes (nombre, edad, carrera)
VALUES ('Ana', 21, 'Ingenier√≠a Inform√°tica')
""")

cursor.execute("""
INSERT INTO estudiantes (nombre, edad, carrera)
VALUES ('Pedro', 23, 'Ingenier√≠a Civil')
""")

conn.commit()

5Ô∏è‚É£ Consultar datos (SELECT)

‚ñ∂Ô∏è Obtener todos los registros

In [ ]:
cursor.execute("SELECT * FROM estudiantes")
resultados = cursor.fetchall()

for fila in resultados:
    print(fila)

‚ñ∂Ô∏è Filtros con WHERE

In [ ]:
cursor.execute("""
SELECT nombre, edad
FROM estudiantes
WHERE edad > 21
""")

for fila in cursor.fetchall():
    print(fila)

‚ñ∂Ô∏è Ordenar resultados (ORDER BY)

In [ ]:
cursor.execute("""
SELECT nombre, edad
FROM estudiantes
ORDER BY edad DESC
""")

print(cursor.fetchall())

6Ô∏è‚É£ Usar SQL con pandas (m√°s c√≥modo)

In [4]:
import pandas as pd

df = pd.read_sql_query("SELECT * FROM estudiantes", conn)
df

   id nombre  edad                 carrera
0   1    Ana    21  Ingenier√≠a Inform√°tica
1   2  Pedro    23        Ingenier√≠a Civil

7Ô∏è‚É£ Actualizar y eliminar registros

üîÑ UPDATE

In [ ]:
cursor.execute("""
UPDATE estudiantes
SET edad = 24
WHERE nombre = 'Pedro'
""")

conn.commit()

‚ùå DELETE

In [ ]:
cursor.execute("""
DELETE FROM estudiantes
WHERE edad < 22
""")

conn.commit()

8Ô∏è‚É£ Cerrar la conexi√≥n

In [ ]:
cursor.execute("""
DELETE FROM estudiantes
WHERE edad < 22
""")

conn.commit()

# Resumen 

- Python usa sqlite3 para ejecutar SQL f√°cilmente.

- SQL permite manipular datos estructurados.

- Las consultas principales son:
SELECT, INSERT, UPDATE, DELETE, CREATE TABLE.

- pandas.read_sql_query() es excelente para an√°lisis.